ArePointCloudsHidden Property
 Indicates if point clouds are currently hidden in the view.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2014
 Syntax
  C#
public bool ArePointCloudsHidden { get; set; }
  Visual Basic
Public Property ArePointCloudsHidden As Boolean
	Get
	Set
  Visual C++
public:
property bool ArePointCloudsHidden {
	bool get ();
	void set (bool value);
}
 Field Value
 True if point clouds are currently hidden in the view, false otherwise.
 See Also
  View Class
  Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →